Repository: leafcolor/tau
Catalog: po/*.po
Languages: eu, fi

source: GTK frontend for the xi text editor
eu: GTK interfaze grafikoa xi testu-editorerako
fi: GTK-käyttöliittymä xi-tekstimuokkaimelle

source: Tau is a GTK frontend for the xi text editor written in Rust. It’s a very fast plain text editor.
eu: Tau Rust lengoaian idatzitako interfaze grafiko bat da, xi testu-editorea erabiltzeko. Testu soilen editore azkarra da.
fi: Tau on GTK-käyttöliittymä Rust-ohjelmointikielellä toteutetulle xi-tekstimuokkaimelle. Xi on erittäin nopea ja pelkistetty tekstimuokkain.

source: The Tau text editor
eu: Tau testu-editorea
fi: Tau-tekstimuokkain

source: Text;Editor;Plaintext;Write;gxi;
eu: testua;editorea,testu soila;idatzi;gxi;
fi: Text;Editor;Plaintext;Write;gxi;editori;muokkain;teksti;

source: Launch a new Tau instance
eu: Abiarazi Tau instantzia berria
fi: Käynnistä uusi Tau-istunto

source: Xi-Editor’s theme
eu: Xi-editorearen gaia
fi: Xi-Editorin teema

source: Sets the theme used for the editing area
eu: Edizio-areak izango duen gaia ezartzen du
fi: Asettaa muokkausalueella käytettävän teeman

source: Draw trailing spaces
eu: Marraztu amaierako zuriuneak
fi: Piirrä rivin lopussa olevat välilyönnit

source: Draw spaces which are at the end of a line
eu: Marraztu lerroaren amaieran dauden zuriuneak
fi: Piirrä rivin lopussa olevat välilyönnit

source: Draw leading spaces
eu: Marraztu hasierako zuriuneak
fi: Piirrä rivin alussa olevat välilyönnit

source: Draw spaces which are at the beginning of a line
eu: Marraztu lerroaren hasieran dauden zuriuneak
fi: Piirrä rivin alussa olevat välilyönnit

source: Draw selected spaces
eu: Marraztu zuriune hautatuak
fi: Piirrä valitut välilyönnit

source: Draw spaces whenever they are selected
eu: Marraztu zuriuneak haiek autatuta badaude
fi: Piirrä välilyönnit kun sellaiset on valittu

source: Draw all spaces
eu: Marraztu zuriune guztiak
fi: Piirrä kaikki välilyönnit

source: Draw spaces, no matter the position
eu: Marraztu zuriuneak haien posizioa kontuan hartu gabe
fi: Piirrä välilyönnit niiden sijainnista huolimatta

source: Draw a right hand margin
eu: Marraztu eskuineko marjina
fi: Piirrä oikea reunus

source: Draw a right hand margin to limit the text width
eu: Marraztu eskuineko marjina testu-zabalera mugatzeko

source: At what column to display the margin
eu: Zein zutabetan bistaratuko den marjina

source: Sets the column at which the margin should be drawn
eu: Marjina zein zutabetan marraztuko den ezartzen du

source: Whether the current line should be highlighted
eu: Uneko lerroa nabarmenduko den ala ez
fi: Korostetaanko nykyinen rivi

source: Sets if the current line should be highlighted, which eases navigation through the document
eu: Uneko lerroa nabarmendu behar den ala ez ezartzen du; horrek dokumentu barneko nabigazioa errazten du

source: Sets the height of the window in the next start-up
eu: Hurrengo abioan leihoak izango duen altuera ezartzen du

source: Sets the width of the window in the next start-up
eu: Hurrengo abioan leihoak izango duen zabalera ezartzen du

source: Sets if the window should be maximized during the next start-up
eu: Hurrengo abioan leihoa maximizatuta agertuko den ala ez ezartzen du

source: Tab size
eu: Fitxa-tamaina
fi: Sarkaimen koko

source: Amount of spaces that a tab is wide
eu: Tabuladore baten zabalerak dituen zuriune kopurua

source: Insert spaces instead of tabs
eu: Txertatu zuriuneak tabuladoreen ordez
fi: Lisää välilyöntejä sarkainten sijaan

source: Whether spaces should be inserted instead of tabs
eu: Tabuladoreen ordez zuriuneak txertatuko diren ala ez

source: Treat indentation with spaces like tabs
eu: Tratatu zuriuneen bidezko koskatzeak tabuladoreak bailiran

source: If “translate-tabs-to-spaces” is true, Backspace will delete multiple spaces, up to the previous tab stop
eu: “translate-tabs-to-spaces” egia bada, atzera-teklak zuriune anitz ezabatuko dita, aurreko tabuladoreraino

source: Automatically match document’s indentation on newlines
eu: Automatikoki bat egin dokumentuak lerro berrietarako duen koskatzearekin

source: The font used for editing
eu: Ediziorako erabiliko den letra-tipoa
fi: Tiedostomuokkaimessa käytettävä fontti

source: Wrap lines at the end of the document
eu: Egokitu lerroak dokumentuaren amaieran

source: Draw trailing tabs
eu: Marraztu amaierako tabuladoreak
fi: Piirrä rivin lopussa olevat sarkaimet

source: Draw tabs which are at the end of a line
eu: Marraztu lerroaren amaieran dauden tabuladoreak

source: Draw leading tabs
eu: Marraztu hasierako tabuladoreak
fi: Piirrä rivin alussa olevat sarkaimet

source: Draw tabs which are at the beginning of a line
eu: Marraztu lerroaren hasieran dauden tabuladoreak

source: Draw selected tabs
eu: Marraztu hautatutako tabuladoreak
fi: Piirrä valitut sarkaimet

source: Draw tabs whenever they are selected
eu: Marraztu tabuladoreak hautatuta badaude

source: Draw all tabs
eu: Marraztu tabuladore guztiak
fi: Piirrä kaikki sarkaimet

source: Draw all tabs, no matter the position
eu: Marraztu tabuladore guztiak haien posizioa kontuan hartu gabe

source: Draw the cursor
eu: Marraztu kurtsorea
fi: Piirrä kursori

source: Whether to draw the cursor
eu: Kurtsorea marraztuko den ala ez

source: Syntax specific settings
eu: Sintaxiarenak diren ezarpenak
fi: Syntaksikohtaiset asetukset

source: A JSON string containing syntax specific settings (e.g. tab width of 2 for YAML)
eu: Sintaxiarenak diren ezarpenak dituen JSON kate bat (adibidez, 2 unitateko tabulazio-zabalera YAML sintaxirako)

source: Save when Tau moves out of focus
eu: Gorde Tau fokutik irteten denean

source: Automatically save all open files when Tau moves out of focus
eu: Automatikoki gorde irekitako fitxategi guztiak Tau fokutik irteten denean

source: Show line count
eu: Erakutsi lerro-zenbaketa
fi: Näytä rivimäärä

source: Whether or not to show the line count in the editing pane
eu: Edizio-panelean lerroen zenbaketa erakutsi den ala ez

source: Open files
eu: Ireki fitxategiak

source: List of file paths open in the current or most recent session
eu: Uneko saioan edo azken saioan irekitako fitxategien bide-izenen zerrenda

source: Restore session
eu: Leheneratu saioa
fi: Palauta istunto

source: Whether or not to restore last session on start-up
eu: Abioan azken saioa leheneratuko den ala ez

source: Full path in title bar
eu: Bide-izen osoa titulu-barran
fi: Koko polku otsikkopalkissa

source: Whether or not to display full path instead of file name in Tau's title bar.
eu: Bide-izen osoa ala fitxategi-izena bistaratuko den Tau aplikazioaren titulu-barran.

source: Show terminal
eu: Erakutsi terminala
fi: Näytä pääte

source: Whether or not to show an integrated terminal in Tau's editing pane
eu: Tauren edizio-panelean terminal integratu bat erakutsiko den ala ez

source: Path to the shell executable
eu: Shell-exekutagarriaren bide-izena
fi: Polku kehotteen suoritustiedostoon

source: The path to the shell you want to use.
eu: Erabiliko den shell-aren bide-izena.
fi: Polku komentokehotteeseen, jota haluat käyttää.

source: Cut
eu: Ebaki
fi: Leikkaa

source: Copy
eu: Kopiatu
fi: Kopioi

source: Paste
eu: Itsatsi
fi: Liitä

source: Undo
eu: Desegin
fi: Kumoa

source: Redo
eu: Berregin
fi: Tee uudestaan

source: Select All
eu: Hautatu dena
fi: Valitse kaikki

source: Enable automatic indentation
eu: Gaitu koskatze automatikoa
fi: Käytä automaattista sisennystä

source: Find
eu: Bilatu
fi: Etsi

source: Find and select all search matches
eu: Bilatu eta hautatu bat etortze guztiak

source: Switch between Search and Search-and-Replace
eu: Txandakatu bilatzeko modua eta bilatu eta ordezteko modua
fi: Vaihda "Etsi"- ja "Etsi ja korvaa"-toimintojen välillä

source: Show or hide search options such as case sensitivity
eu: Erakutsi edo ezkutatu bilaketa-aukerak, adibidez maiuskulen/minuskulen bereizketa
fi: Näytä tai piilota hakuvalinnat kuten kirjainkoon merkitsevyys

source: Replace
eu: Ordeztu
fi: Korvaa

source: Replace All
eu: Ordeztu denak
fi: Korvaa kaikki

source: Regular expressions
eu: Adierazpen erregularrak
fi: Säännölliset lausekkeet

source: Case sensitive
eu: Maiuskulak/minuskulak
fi: Kirjainkoko merkitsee

source: Match whole word only
eu: Bat etorri hitz osoarekin soilik
fi: Täsmää vain kokonaiset sanat

source: No Results
eu: Ez dago emaitzarik
fi: Ei tuloksia

# shortcut window
source: Documents
eu: Dokumentuak
fi: Asiakirjat

# shortcut window
source: Create new document
eu: Sortu dokumentu berria
fi: Luo uusi asiakirja

# shortcut window
source: Open a document
eu: Ireki dokumentua
fi: Avaa asiakirja

# shortcut window
source: Save the document
eu: Gorde dokumentua
fi: Tallenna asiakirja

# shortcut window
source: Save the document as…
eu: Gorde dokumentua honela…
fi: Tallenna asiakirja nimellä…

# shortcut window
source: Close the document
eu: Itxi dokumentua
fi: Sulje asiakirja

# shortcut window
source: Navigation
eu: Nabigazioa
fi: Liikkuminen

# shortcut window
source: Cycle tab history backward
eu: Joan atzerantz tabuladoreen historian
fi: Vaihda taaksepäin välilehtihistoriassa

# shortcut window
source: Cycle tab history forward
eu: Joan aurrerantz tabuladoreen historian
fi: Vaihda eteenpäin välilehtihistoriassa

# shortcut window
source: Go to line
eu: Joan lerrora
fi: Siirry riville

# shortcut window
source: Toggle fullscreen
eu: Txandakatu pantaila osoa
fi: Koko näyttö päälle/pois

# shortcut window
source: Find
eu: Bilatu
fi: Haku

# shortcut window
source: Find the next match
eu: Bilatu hurrengo parekatzea
fi: Etsi seuraava osuma

# shortcut window
source: Find the previous match
eu: Bilatu aurreko parekatzea
fi: Etsi edellinen osuma

# shortcut window
source: Find and replace
eu: Bilatu eta ordeztu
fi: Etsi ja korvaa

# shortcut window
source: Find all matches
eu: Bilatu parekatze guztiak
fi: Etsi kaikki osumat

# shortcut window
source: Close the find window
eu: Itxi bilaketaren leihoa
fi: Sulje hakuikkuna

# shortcut window
source: Editing
eu: Edizioa
fi: Muokkaaminen

# shortcut window
source: Highlight the next occurrence of the current selection
eu: Nabarmendu uneko hautapenaren hurrengo agerraldia

# shortcut window
source: Delete the current selection
eu: Ezabatu uneko hautapena
fi: Poista nykyinen valinta

# shortcut window
source: Delete an entire word
eu: Hautatu hitz oso bat
fi: Poista koko sana

# shortcut window
source: Outdent the current selection
eu: Kendu koska uneko hautapenari
fi: Vähennä nykyisen valinnan sisennystä

# shortcut window
source: Move to start of the line
eu: Eraman lerroaren hasierara
fi: Siirry rivin alkuun

# shortcut window
source: Move to start of the document
eu: Eraman dokumentuaren hasierara
fi: Siirry asiakirjan alkuun

# shortcut window
source: Move to end of the line
eu: Eraman lerroaren amaierara
fi: Siirry rivin loppuun

# shortcut window
source: Move to end of the document
eu: Eraman dokumentuaren amaierara
fi: Siirry asiakirjan loppuun

# shortcut window
source: Move up for the height of the view
eu: Eraman gora bistaren altueran
fi: Siirrä näkymän verran ylös

# shortcut window
source: Move down for the height of the view
eu: Eraman behera bistaren altueran
fi: Siirrä näkymän verran alas

# shortcut window
source: Enable/Disable the cursor
eu: Gaitu/Desgaitu kurtsorea
fi: Käytä kursoria tai poista se käytöstä

# shortcut window
source: Copy and Paste
eu: Kopiatu eta itsatsi
fi: Kopiointi ja liittäminen

# shortcut window
source: Copy the current selection
eu: Kopiatu uneko hautapena
fi: Kopioi nykyinen valinta

# shortcut window
source: Paste what's currently in the clipboard
eu: Itsatsi arbelean dagoena
fi: Liitä sisältö leikepöydältä

# shortcut window
source: Cut the current selection
eu: Ebaki uneko hautapena
fi: Leikkaa nykyinen valinta

# shortcut window
source: Undo and Redo
eu: Desegin eta berregin
fi: Kumoaminen ja uudelleentekeminen

# shortcut window
source: Undo
eu: Desegin
fi: Kumoa

# shortcut window
source: Redo
eu: Berregin
fi: Tee uudestaan

# shortcut window
source: Selections
eu: Hautapenak
fi: Valinnat

# shortcut window
source: Select all
eu: Hautatu dena
fi: Valitse kaikki

# shortcut window
source: Select all occurences of the current selection
eu: Hautatu uneko hautapenaren agerraldi guztiak

# shortcut window
source: Move up and select everything from current cursor position
eu: Eraman gora eta hautatu uneko kurtsorearen posiziotik dagoen guztia

# shortcut window
source: Move down and select everything from current cursor position
eu: Eraman behera eta hautatu uneko kurtsorearen posiziotik dagoen guztia

# shortcut window
source: Move left and select everything from current cursor position
eu: Eraman ezkerrera eta hautatu uneko kurtsorearen posiziotik dagoen guztia

# shortcut window
source: Move left and select the next word
eu: Eraman ezkerrera eta hautatu uneko hitza

# shortcut window
source: Move right and select everything from current cursor position
eu: Eraman eskuinera eta hautatu uneko kurtsorearen posiziotik dagoen guztia

# shortcut window
source: Move right and select the next word
eu: Eraman eskuinera eta hautatu hurrengo hitza

# shortcut window
source: Move to start of the line and select
eu: Eraman lerroaren hasierara eta hautatu

# shortcut window
source: Move to start of the document and select
eu: Eraman dokumentuaren hasierara eta hautatu

# shortcut window
source: Move to end of the line and select
eu: Eraman lerroaren amaierara eta hautatu

# shortcut window
source: Move to end of the document and select
eu: Eraman dokumentuaren amaierara eta hautatu

# shortcut window
source: Move up for the height of the view and select
eu: Eraman gora bistaren altueran eta hautatu

# shortcut window
source: Move down for the height of the view and select
eu: Eraman behera bistaren altueran eta hautatu

source: Preferences
eu: Hobespenak
fi: Asetukset

source: View
eu: Ikusi
fi: Näkymä

source: Preferences related to the View’s look
eu: Bistaren itxurari lotutako hobespenak
fi: Näkymän ulkoasuun vaikuttavat asetukset

source: Display right hand margin
eu: Bistaratu eskuineko marjina
fi: Näytä oikea reunus

source: Highlight the current line
eu: Nabarmendu uneko lerroa
fi: Korosta nykyinen rivi

source: Show full path in title bar
eu: Erakutsi bide-izen osoa titulu-barran
fi: Näytä koko polku otsikkopalkissa

source: Restore last opened files on start-up
eu: Leheneratu irekitako azken fitxategiak abioan
fi: Palauta avoinna olleet tiedostot käynnistäessä

source: Wrap lines at the end of the view
eu: Egokitu lerroak bistaren amaieran
fi: Rivitä visuaalisesti pitkät rivit

source: Theme configuration
eu: Gaiaren konfigurazioa
fi: Teeman määritys

source: Syntax configuration
eu: Sintaxiaren konfigurazioa
fi: Syntaksin määritykset

source: Syntax selection
eu: Sintaxiaren hautapena
fi: Syntaksin valinta

source: Syntax-specific tab size
eu: Sintaxiaren araberako tabuladore-tamaina
fi: Syntaksikohtainen sarkaimen koko

source: Apply syntax configuration settings
eu: Aplikatu sintaxi-konfigurazioaren ezarpenak
fi: Toteuta syntaksimäärityksen asetukset

source: Editor
eu: Editorea
fi: Muokkain

source: Indention
eu: Koskak
fi: Sisennys

source: Automatic indentation
eu: Koska automatikoak
fi: Automaattinen sisennys

source: Delete spaces up to the previous tab stop
eu: Zuriuneak ezabatzen ditu aurreko tabulazio-geldiuneraino
fi: Poista välilyönnit edelliseen sarkainpysähdykseen asti

source: File saving
eu: Fitxategia gordetzea
fi: Tiedostojen tallennus

source: Save files when the Tau goes out of focus
eu: Gorde fitxategiak Tau fokutik irteten denean
fi: Tallenna tiedostot kun kohdistus siirtyy pois Tausta

source: Terminal
eu: Terminala
fi: Pääte

source: Show the embedded terminal on startup
eu: Erakutsi terminal kapsulatua abioan
fi: Näytä upotettu pääte käynnistäessä

source: What shell to start
eu: Zein shell abiaraziko den
fi: Käynnistettävä kehote

source: Highlighting spaces
eu: Zuriuneak nabarmentzea
fi: Välilyöntien korostaminen

source: Don't draw spaces
eu: Ez marraztu zuriuneak
fi: Älä piirrä välilyöntejä

source: Highlighting tabs
eu: Fitxak nabarmentzea
fi: Sarkainten korostaminen

source: Don't draw tabs
eu: Ez marraztu fitxak
fi: Älä piirrä sarkaimia

source: Font configuration
eu: Letra-tipoen konfigurazioa
fi: Fontin määritys

source: Save As…
eu: Gorde honela…
fi: Tallenna nimellä…

source: Save All
eu: Gorde dena
fi: Tallenna kaikki

source: Find…
eu: Bilatu…
fi: Etsi…

source: Replace…
eu: Ordeztu…
fi: Korvaa…

source: Go To Line…
eu: Joan lerrora…
fi: Siirry riville…

source: Show Terminal
eu: Erakutsi terminala
fi: Näytä pääte

source: Toggle Fullscreen
eu: Txandakatu pantaila osoa
fi: Koko näyttö päälle/pois

source: Help
eu: Laguntza
fi: Ohje

source: Keyboard Shortcuts
eu: Laster-teklak
fi: Pikanäppäimet

source: About Tau
eu: Tau aplikazioari buruz
fi: Tietoja - Tau

source: Open
eu: Ireki
fi: Avaa

source: Save
eu: Gorde
fi: Tallenna

source: Untitled
eu: Izengabea
fi: Nimetön

source: Line
eu: Lerroa
fi: Rivi

source: Column
eu: Zutabea
fi: Sarake

source: Plain Text
eu: Testu soila
fi: Raakateksti

source: Tab Size
eu: Tabuladorearen tamaina
fi: Sarkaimen koko

source: GTK frontend for the xi text editor, written in Rust
eu: GTK interfaze grafikoa xi testu-editorerako, Rust lengoaian idatzia
fi: GTK-käyttöliittymä Rust-ohjelmointikielellä toteutetulle xi-tekstimuokkaimelle

source: Welcome to Tau's terminal.
eu: Ongi etorri Tau aplikazioaren terminalera.
fi: Tervetuloa Taun päätteeseen.

source: Start a new instance of the application
eu: Abiarazi aplikazioaren beste instantzia bat
fi: Käynnistä uusi instanssi sovelluksesta

source: Couldn’t get Documents directory to autosave unnamed file. Please make sure “XDG_DATA_DIR” or similar is set.
eu: Ezin izan da 'Dokumentuak' direktorioa eskuratu izenik gabeko fitxategia automatikoki gordetzeko. Ziurtatu “XDG_DATA_DIR” edo antzekoa ezarrita dagoela.

source: Save unsaved changes
eu: Gorde aldaketak
fi: Tallenna tallentamattomat muutokset

source: Close Without Saving
eu: Itxi gorde gabe
fi: Sulje tallentamatta

source: Cancel
eu: Utzi
fi: Peru

source: Open a file to edit
eu: Ireki fitxategi bat hura editatzeko
fi: Avaa tiedosto muokattavaksi

source: Couldn’t open file
eu: Ezin da fitxategia ireki
fi: Tiedostoa ei voitu avata

source: Save file
eu: Gorde fitxategia
fi: Tallenna tiedosto

source: Couldn’t save file
eu: Ezin da fitxategia gorde
fi: Tiedostoa ei voitu tallentaa

source: Couldn’t find the xi-syntect-plugin. As such these settings won’t work in the current session.
eu: Ez da xi-syntect-plugin plugina aurkitu. Ezarpen hauek ez dute funtzionatuko uneko saioan.

source: translator-credits
fi: Jiri Grönroos
